Revit 2026 API

# CompoundStructureIsVerticallyCompound Property

---

Identifies if this CompoundStructure represents a layout that is more complicated than a simple set of parallel layers.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool IsVerticallyCompound { get; }
```
```vb
Public ReadOnly Property IsVerticallyCompound As Boolean
	Get
```
```cpp
public:
property bool IsVerticallyCompound {
	bool get ();
}
```
```fsharp
member IsVerticallyCompound : bool with get
```

#### Property Value

Boolean

Vertically compound structures should be assigned only to walls.

#### Reference

CompoundStructure Class

Autodesk.Revit.DB Namespace